Revit 2022 API
BuiltInFailures.OverlapFailures.ELASeparationLinesOverlap Property
 Highlighted load area separation lines overlap. One of them may be ignored when Revit finds load area boundaries. Delete one of the lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public static FailureDefinitionId ELASeparationLinesOverlap { get; }
Visual Basic
Public Shared ReadOnly Property ELASeparationLinesOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ELASeparationLinesOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace